Ansersion/Beecom/test/beecom_test_wifi/FreeRTOS/Demo/CORTEX_STM32F103_Keil/beecom_test_wifi.c
#include "beecom_test_wifi.h"

#include "stm32f10x_nvic.h"
#include "stm32f10x_usart.h"
#include "stm32f10x_rcc.h"
#include "stm32f10x_gpio.h"

#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "semphr.h"

#include <stdio.h>
#include <string.h>
#include <ctype.h>
#include <stdlib.h>

#define BC_CENTER_SERV_PORT 	54321

#define HFSR 	((uint32_t *)0xE000ED2C)
#define MFSR ((char *)0xE000ED28)
#define BFSR ((char *)0xE000ED29)
#define UFSR ((char *)0xE000ED2A)
#define BFAR ((uint32_t *)0xE000ED38)

// Scheme:
// socket 0: server
// socket 1: client
// socket 2: reserved
#define BC_MAX_SOCKET_NUM 		5
#define ASSERT_SOCK_VALID(s) ((s) >= 0 && (s) < BC_MAX_SOCKET_NUM)

#define NUM_ASCII_SIZE 	6
uint8_t IPDNum[NUM_ASCII_SIZE];

uint8_t WIFI_FLAG_OK_END[] = "OK\r\n";
uint32_t WIFI_FLAG_OK_END_SIZE = sizeof(WIFI_FLAG_OK_END) - 1;
uint8_t WIFI_FLAG_ERROR_END[] = "ERROR\r\n";
uint32_t WIFI_FLAG_ERROR_END_SIZE = sizeof(WIFI_FLAG_ERROR_END) - 1;
uint8_t WIFI_FLAG_CONN_END[] = "CONNECT\r\n";
uint32_t WIFI_FLAG_CONN_END_SIZE = sizeof(WIFI_FLAG_CONN_END) - 1;
uint8_t WIFI_FLAG_CLOSED_END[] = "CLOSED\r\n";
uint32_t WIFI_FLAG_CLOSED_END_SIZE = sizeof(WIFI_FLAG_CLOSED_END) - 1;
uint8_t WIFI_FLAG_STATUS_END[] = "+CIPSTATUS";
uint32_t WIFI_FLAG_STATUS_END_SIZE = sizeof(WIFI_FLAG_STATUS_END) - 1;

uint8_t WIFI_FLAG_IPD_ST[] = "+IPD";
uint32_t WIFI_FLAG_IPD_ST_SIZE = sizeof(WIFI_FLAG_IPD_ST) - 1;
// TODO
uint8_t INADDR_ANY[16];
uint32_t StartReceiveFlag = 0;
uint32_t StartAcceptFlag = 0;
BC_Sockaddr * k_cliaddr = NULL;
uint32_t * k_addrlen = NULL;

sint8_t xxx;
sint8_t msg[256];
uint8_t u16data[32];

xSemaphoreHandle xMutexWifiStateFlag = NULL;
xSemaphoreHandle xMutexRecvFlag = NULL;

#define WIFI_BUF_SIZE 	4096
uint8_t usart_wifi_buf[WIFI_BUF_SIZE];

uint8_t SrvBuf[TASK_BUF_SIZE]; 

// TODO:
// "WifiRecvFlag" need a mutex
uint32_t WifiRecvFlag = 0; // general recv flag
BC_SocketData sock_data[BC_MAX_SOCKET_NUM];

#define SOCKET_BUF_SIZE 1024
// BC_MAX_SOCKET_NUM sock buffer
uint8_t SockBuf_0[SOCKET_BUF_SIZE];
uint8_t SockBuf_1[SOCKET_BUF_SIZE];
uint8_t SockBuf_2[SOCKET_BUF_SIZE];
uint8_t SockBuf_3[SOCKET_BUF_SIZE];
uint8_t SockBuf_4[SOCKET_BUF_SIZE];


static QueueHandle_t xQueue0 = NULL;
static QueueHandle_t xQueue1 = NULL;
static QueueHandle_t xQueue2 = NULL;
static QueueHandle_t xQueue3 = NULL;
static QueueHandle_t xQueue4 = NULL;

// 
sint32_t BC_Init(void)
{
	// TickType_t delay_ms = 50;
	int i = 0;

	// Led indication initialization
	LedInit();
	// USART_TERMINAL initialization
	Usart1Init(9600); 
	// USART_WIFI initialization
	Usart2Init(115200);
	// Buffer initialization
	BufInit();
	// Socket buffer initialization
	SocketInit();

	if(BC_QueueInit() != BC_OK) {
		while(1) {
			for(i = 0; i < 100000; i++) {
				sprintf(msg, "QueueInit Error!\r\n");
				uputs(USART_TERMINAL, msg);
			}
		}
		return BC_ERR;
	}
	// if(BC_MutexInit() != BC_OK) {
	// 	sprintf(msg, "MutexInit Error!\r\n");
	// 	uputs(USART_TERMINAL, msg);
	// 	return BC_ERR;
	// }
	return BC_OK;
}

void LedInit(void)
{		
	GPIO_InitTypeDef GPIO_InitType;
	GPIO_TypeDef * GPIO_Type;
	
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA|RCC_APB2Periph_GPIOD, ENABLE);
	
	// GPIO output initialization;
	GPIO_InitType.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitType.GPIO_Speed = GPIO_Speed_50MHz;
	
	// Initialize PA.8
	GPIO_Type = GPIOA;
	GPIO_InitType.GPIO_Pin = GPIO_Pin_8;
	GPIO_Init(GPIO_Type, &GPIO_InitType);
	
	// Initialize PD.2
	GPIO_Type = GPIOD;
	GPIO_InitType.GPIO_Pin = GPIO_Pin_2;
	GPIO_Init(GPIO_Type, &GPIO_InitType);
}

void Usart1Init(uint32_t bound)
{
	USART_InitTypeDef USART_InitStructure;
	GPIO_InitTypeDef GPIO_InitStructure; 
	NVIC_InitTypeDef NVIC_InitStructure;
	
	/* Enable GPIO clock */
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_AFIO, ENABLE);
	
	/* USART clock */
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE); 

	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz; 
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP; 
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9; 
	GPIO_Init(GPIOA,&GPIO_InitStructure); 

	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING; 
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10; 
	GPIO_Init(GPIOA,&GPIO_InitStructure); 
	
	USART_DeInit(USART1);
	
	/* Usart init，9600，8bit data bit,1 stop bit, No Parity and flow control, rx tx enable */
	USART_InitStructure.USART_BaudRate               = bound;
	USART_InitStructure.USART_WordLength             = USART_WordLength_8b;
	USART_InitStructure.USART_StopBits               = USART_StopBits_1;
	USART_InitStructure.USART_Parity                 = USART_Parity_No;
	USART_InitStructure.USART_HardwareFlowControl    = USART_HardwareFlowControl_None;
	USART_InitStructure.USART_Mode                   = USART_Mode_Rx | USART_Mode_Tx;
	USART_Init(USART1, &USART_InitStructure);
	
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2); 

	NVIC_InitStructure.NVIC_IRQChannel = USART1_IRQChannel;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);
	
	USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
		
	USART_Cmd(USART1, ENABLE);
}

void Usart2Init(uint32_t bound)
{

    GPIO_InitTypeDef GPIO_InitStructure;
    NVIC_InitTypeDef NVIC_InitStructure;
    USART_InitTypeDef USART_InitStructure;
    
    // Enable the USART2 Pins Software Remapping
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA , ENABLE);
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE); 
    
    // Configure USART2 Rx (PA.03) as input floating
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3;    
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOA, &GPIO_InitStructure);
    
    // Configure USART2 Tx (PA.02) as alternate function push-pull
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOA, &GPIO_InitStructure);
    
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2); 
	
    // Enable the USART2 Interrupt
    NVIC_InitStructure.NVIC_IRQChannel = USART2_IRQChannel;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 3;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 2;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);    
	
