Ansersion/Beecom/test/beecom_test_wifi/FreeRTOS/Demo/CORTEX_STM32F103_Keil/beecom_test_wifi.c
	return 0;
}


void vTcpServerTask(void *pvParameters)
{
	BC_Sockaddr server_addr;
	BC_Sockaddr client_addr;
	sint32_t server_socket = 0;
	sint32_t client_socket;
	uint32_t addr_len = sizeof(BC_Sockaddr);
	sint32_t trans_len = 0;
	
	memset(&server_addr, 0, sizeof(BC_Sockaddr));
	server_addr.sin_family = AF_INET;
	// diff: string not long
	memcpy(server_addr.sin_addr.s_addr, INADDR_ANY, sizeof(INADDR_ANY));
	// diff: host order not net order
	server_addr.sin_port = BC_CENTER_SERV_PORT;
	
	server_socket = BC_Socket(AF_INET, SOCK_STREAM, 0);
	if(server_socket < 0) {
		printf("Error: Create socket failed\r\n");
		vTaskDelete(NULL);
		return;
	}
	if(BC_Bind(server_socket,&server_addr,sizeof(server_addr)) != 0) {
        printf("Server Bind Port : %d Failed!\r\n", server_addr.sin_port); 
        vTaskDelete(NULL);
		return;
    }
	if (BC_Listen(server_socket, LISTEN_QUEUE) != 0) {
        printf("Server Listen Failed!\r\n"); 
        vTaskDelete(NULL);
		return;
    }
	
	while(TRUE) {
		memset(&client_addr, 0, sizeof(BC_Sockaddr));
		memset(SrvBuf, 0, TASK_BUF_SIZE);
		client_socket = BC_Accept(server_socket, &client_addr,&addr_len);
        if (client_socket < 0) {
            printf("Server Accept Failed!\r\n");
            break;
        }
		trans_len = BC_Recv(client_socket, SrvBuf, TASK_BUF_SIZE, 0);
		if(trans_len <= 0) {
			printf("Server Recv Failed\r\n");
			BC_Close(client_socket);
			continue;
		}
		printf("Recv from %s:%d\r\n", client_addr.sin_addr.s_addr, client_addr.sin_port);
		printf("Msg: #%s#\r\n", SrvBuf);
		printf("Echoing now...\r\n");
		trans_len = BC_Send(client_socket, SrvBuf, TASK_BUF_SIZE, 0);
		if(trans_len < 0) {
			printf("Server Send Failed\r\n");
			BC_Close(client_socket);
			continue;
		}
		BC_Close(client_socket);
	}
	
	BC_Close(server_socket);
	vTaskDelete(NULL);
	return;
}

sint32_t BC_Socket(sint32_t family, sint32_t type, sint32_t protocol)
{
	int i;
	for(i = 0; i < BC_MAX_SOCKET_NUM; i++) {
		if(!sock_data[i].valid) {
			sock_data[i].valid = TRUE;
			return i;
		}
	}
	return -1;
}

sint32_t BC_Bind(sint32_t sockfd, const BC_Sockaddr * myaddr, uint32_t addrlen)
{
	if(!ASSERT_SOCK_VALID(sockfd)) {
		return -1;
	}
	if(!myaddr) {
		return -2;
	}
	if(!sock_data[sockfd].valid) {
		return -3;
	}
	memcpy(&(sock_data[sockfd].addr), myaddr, addrlen);
	return 0;
}

sint32_t BC_Listen(sint32_t sockfd, sint32_t backlog)
{
	if(!ASSERT_SOCK_VALID(sockfd)) {
		return -1;
	}
	if(backlog < 0) {
		return -2;
	}
	if(!sock_data[sockfd].valid) {
		return -3;
	}
	sock_data[sockfd].backlog = backlog;
	// sprintf(msg, "AT+CIPSERVER=1,%d", sock_data[sockfd].addr.sin_port);
	// uputs(USART_WIFI, msg);
	sprintf(msg, "Server info: IP=%s, PORT=%d\r\n", INADDR_ANY, sock_data[sockfd].addr.sin_port);
	uputs(USART_TERMINAL, msg);
	
	return 0;
}

sint32_t BC_Accept(sint32_t sockfd, BC_Sockaddr * cliaddr, uint32_t * addrlen)
{
	if(!ASSERT_SOCK_VALID(sockfd)) {
		return -1;
	}
	if(!cliaddr) {
		return -2;
	}
	if(!addrlen) {
		return -3;
	}
	if(!sock_data[sockfd].valid) {
		return -4;
	}
	// wait for the semphore
	
	// StartReceiveFlag = 1;
	SET_START_RECV_FLAG(1);
	StartAcceptFlag = 1;
	
	k_cliaddr = cliaddr;
	k_addrlen = addrlen;
	while(StartAcceptFlag)
		;
	// TODO:
	// check the server sockfd
	
	return 0;
}

sint32_t BC_Connect(sint32_t sockfd, const BC_Sockaddr * servaddr, uint32_t addrlen)
{
	if(!ASSERT_SOCK_VALID(sockfd)) {
		return -1;
	}
	if(!servaddr) {
		return -2;
	}
	if(!sock_data[sockfd].valid) {
		return -3;
	}

	sprintf(msg, "AT+CIPSTART=%d,\"TCP\",\"%s\",%d", sockfd, servaddr->sin_addr.s_addr, servaddr->sin_port);
	return 0;
}

sint32_t BC_Close(sint32_t sockfd)
{
	if(!ASSERT_SOCK_VALID(sockfd)) {
		return -1;
	}
	if(!sock_data[sockfd].valid) {
		return -2;
	}
	sprintf(msg, "AT+CIPCLOSE=%d", sockfd);
	uputs(USART_WIFI, msg);
	sock_data[sockfd].valid = FALSE;
	return 0;
}

sint32_t BC_Recv(sint32_t sockfd, void * buff, uint32_t nbytes, sint32_t flags)
{
	if(!ASSERT_SOCK_VALID(sockfd)) {
		return -1;
	}
	if(!buff) {
		return -2;
	}
	if(!sock_data[sockfd].valid) {
		return -3;
	}
	// wait semphore
	// StartReceiveFlag = 1;
	SET_START_RECV_FLAG(1);
	while(StartReceiveFlag)
		;
	// read USART_WIFI(in ISA)
	// taskYIELD
	return 0;
}

sint32_t BC_Send(sint32_t sockfd, const void * buff, uint32_t nbytes, sint32_t flags)
{
	if(!ASSERT_SOCK_VALID(sockfd)) {
		return -1;
	}
	if(!buff) {
		return -2;
	}
	if(!sock_data[sockfd].valid) {
		return -3;
	}

	// memset(msg, 0, sizeof(msg));
	
	sprintf(msg, "AT+CIPSEND=0,%d", nbytes);
	uputs(USART_WIFI, msg);
	vTaskDelay(10); // TODO
	uputs(USART_WIFI, (sint8_t *)buff);
	vTaskDelay(10); // TODO
	
	return 0;
}

sint32_t GET_START_RECV_FLAG(uint32_t * u32F)
{
	if(!xMutexWifiStateFlag) {
		return -1;
	}
	if(!u32F) {
		return -2;
	}
	if(pdTRUE != xSemaphoreTake(xMutexWifiStateFlag, portMAX_DELAY)) {
		return -3;
	}
	*u32F = StartReceiveFlag;
	if(pdTRUE != xSemaphoreGive(xMutexWifiStateFlag)) {
		return -4;
	}
	return 0;
}

sint32_t SET_START_RECV_FLAG(uint32_t u32F)
{
	if(!xMutexWifiStateFlag) {
		return -1;
	}
	if(pdTRUE != xSemaphoreTake(xMutexWifiStateFlag, portMAX_DELAY)) {
		return -3;
	}
	StartReceiveFlag = u32F;
	if(pdTRUE != xSemaphoreGive(xMutexWifiStateFlag)) {
		return -4;
	}
	return 0;
}

sint32_t GET_START_RECV_FLAG_ISR(uint32_t * u32F)
{
	static BaseType_t xHigherPriorityTaskWoken;
	if(!xMutexWifiStateFlag) {
		return -1;
	}
	if(!u32F) {
		return -2;
	}
	if(pdTRUE != xSemaphoreTakeFromISR(xMutexWifiStateFlag, &xHigherPriorityTaskWoken)) {
		return -3;
	}
	*u32F = StartReceiveFlag;
	if(pdTRUE != xSemaphoreGiveFromISR(xMutexWifiStateFlag, &xHigherPriorityTaskWoken)) {
		return -4;
	}
	return 0;
}

sint32_t SET_START_RECV_FLAG_ISR(uint32_t u32F)
{
	static BaseType_t xHigherPriorityTaskWoken;
	if(!xMutexWifiStateFlag) {
		return -1;
	}
	if(pdTRUE != xSemaphoreTakeFromISR(xMutexWifiStateFlag, &xHigherPriorityTaskWoken)) {
		return -3;
	}
	StartReceiveFlag = u32F;
	if(pdTRUE != xSemaphoreGiveFromISR(xMutexWifiStateFlag, &xHigherPriorityTaskWoken)) {
		return -4;
	}
	return 0;
}

sint32_t BC_Atoi(char n)
{
	return n - '0';
}

sint32_t CheckWifiData(uint8_t * buf, uint32_t buf_size, uint8_t * flag, uint32_t flag_size, bool_t is_end_term)
{
	static sint32_t i = 0;
	// static sint32_t j = 0;
	if(buf_size < flag_size) {
		return BC_ERR;
	}
	if(!buf) {
		return BC_ERR;
	}
	if(!flag) {
		return BC_ERR;
	}
	if(is_end_term) {
		for(i = 0; i < flag_size; i++) {
			if(buf[buf_size - flag_size + i] != flag[i]) {
				return BC_ERR;
			}
		}
	} else {
		for(i = 0; i < flag_size; i++) {
			if(buf[i] != flag[i]) {
				return BC_ERR;
			}
		}
	}
	return BC_OK;
}

